;━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
; [ 간단 autoHokey 문법 정리 ]
;━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
 
; 키 지정 방법: https://autohotkey.com/docs/Hotkeys.htm
; 전체 키 목록: https://autohotkey.com/docs/KeyList.htm
 
; #: Win
; !: Alt
; ^: Ctrl
; +: Shift
; &: 두개의 키 조합
 
; send는 한문자 일일이 타이핑하게 되고 (속도가 느리고)
; sendinput은 복사하여 붙여넣는 스피드로 (속도가 빠르다)
 
; { } 안에는 특정 키를 누르게 되며, { } 없는 것은 문자열로 인식하게 되어 타이핑 쳐지게 된다.
 
;━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
; - 기본 capslock기능을 꺼둠
;━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
SetCapsLockState, AlwaysOff
 
;━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
; - capslock + f 키로 기본 capslock를 키고 끔
;━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
Capslock & f::Capslock
 
;━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
; - Capslock키를 누르고 있을경우
;━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
#If GetKeyState("Capslock","P")
 
;━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
; - 방향키
;━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━	
i::Up
j::Left
k::Down
l::Right
 
q & j::^Left ; 캡스락 + q + j : 빠르게 이동
q & l::^Right
 
;━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
; - 커맨드
;━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
w::PgUp
a::Home
s::PgDn
d::End
 
Left::Home
Right::End
Up::PgUp
Down::PgDn
 
Enter::^Enter ; - 커서를 끝까지 옮기지 않고 그자리에서 바로 엔터처리
;BackSpace::Esc
o::BackSpace
u::Del
 
;━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
; - 코딩 특수기호
;━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
;m::Send, {-}
;,::Send, {_}
;.::Send, {=}
;/::Send, {+}
 
;q & m::Send, {-}{>} ; - 인스턴스 참조
;q & ,::Send, {<}{=} ; - 논리값
;q & .::Send, {>}{=}
;q & /::Send, {=}{>} ; - 화살표함수
 
'::Send, {``} ; - 백틱
q & '::Send, {~}
 
[::Send, {/}{*} ; - 주석
]::Send, {*}{/}
q & [::Send, {<}{!}{-}{-}
q & ]::Send, {-}{-}{>} 
 
;9::Send, {[}  
;0::Send, {]}
;q & 9::Send, {{}
;q & 0::Send, {}}
 
;━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
; - 자주 쓰는 문장 자동완성 단축키
;━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━	
1::SendInput, console.log(){Left}
2::SendInput, ${{}{}}{Left}
;3::SendInput,
 
;━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
; - 한/영 단축키 변경
;━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━		
; Alt::
;    Send, {vk15sc138} ; shift + space를 한영키로 사용
; return